podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/RTC_MK82F25615.svd.xml
            <register>
               <name>RAR</name>
               <description>Read Access Register\n
Protects register against reads.  Any reads are ignored</description>
               <addressOffset>0x804</addressOffset>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>TSRR</name>
                     <description>Time Seconds Register Read Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Reads ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reads OK</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TSRR" > <name>TPRR</name> <description>Time Prescaler Register Read Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>TARR</name> <description>Time Alarm Register Read Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>TCRR</name> <description>Time Compensation Register Read Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>CRR</name> <description>Control Register Read Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>SRR</name> <description>Status Register Read Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>LRR</name> <description>Lock Register Read Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TSRR" > <name>IERR</name> <description>Interrupt Enable Register Read Enable</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
         </registers>
      </peripheral>
